# Задача 2. Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.
# *Пример:*
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

def multy(a):
    result = []
    if len(a) % 2 == 0:
        size = len(a) // 2
    else:
        size = len(a)//2 + 1

    for i in range(0, size):
        result.append(a[i] * a[-(i + 1)])
    return result

num = [2, 3, 4, 5, 6]
print(f'Произведение пар чисел списка {num} равно {multy(num)}')
